Artillery/httpbin_test2.yml
config:
  target: "https://postman-echo.com"
  phases:
    - duration: 60
      arrivalRate: 15
      name: Endurance test
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 1000
    conditions:
      - expression: "http.response_time.p95 < 5"
      - expression: "http.response_time.max < 10"
      - expression: http.codes.200 > 0
      - expression: vusers.failed == 0
      - expression: "http.request_rate >= 2 and http.response_time.max < 600"


scenarios:
  - name: Getting a resource
    flow:
    - get:
        url: "https://postman-echo.com/get"
    - post:
        url: "https://postman-echo.com/post"
        json: 
            username: "Test User"
            password: "Temp Password"